Autodesk.Revit.DB.Plumbing.FluidType.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Plumbing.FluidType.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Plumbing.FluidType.GetFluidTypeIterator
Gets the FluidTemperatureSetIterator to the fluid type.
Returns:
The FluidTemperatureSetIterator to the fluid type.
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.RemoveTemperature(System.Double)
Removes a fluid temperature via the temperature value from the set.
temperature:
The temperature value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the temperature that will be removed doesn't exist in the fluid type
or the temperature that will be removed is in use.
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.AddTemperature(Autodesk.Revit.DB.Plumbing.FluidTemperature)
Adds a fluid temperature to the set.
fluidTemperature:
The fluid temperature being inserted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the temperature that will be added already exists in the fluid type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.GetTemperature(System.Double)
Gets a copy of the FluidTemperature object matching a given temperature value.
Remarks:
Changes made to this object will not be applied to the FluidType object.
In order to modify the FluidTemperature settings for a given temperature,
you should remove the existing FluidTemperature (RemoveTemperature()) and then add the modified value (AddTemperature()).
temperature:
The temperature value.
Returns:
The fluid temperature. null if not found.
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.ClearAllTemperatures
Clears all fluid temperatures in the set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if some temperatures in the FluidType object are in use.
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.IsFluidInUse(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if the fluid type is in use.
Remarks:
If a fluid type is in use, it cannot be deleted.
document:
The document.
fluidId:
The id of the fluid type.
Returns:
True if the fluid type is in use.
False if the fluid type is not in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.GetFluidType(Autodesk.Revit.DB.Document,System.String)
Gets a fluid type by name.
document:
The document.
fluidTypeName:
The name of fluid type.
Returns:
The fluid type. null if the fluid type was not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Plumbing.FluidType)
Creates a new fluid type and adds it to the document.
Remarks:
The new fluid type will be a duplicate of the input type.
document:
The document.
fluidTypeName:
The name of new created fluid type.
basedOnFluidType:
The existing fluid type which is based on.
Returns:
The newly created fluid type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new empty fluid type and adds it to the document.
document:
The document.
fluidTypeName:
The name of fluid type.
Returns:
The newly created fluid type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.GetFluidTemperatureSetIterator
Returns a FluidTemperatureSetIterator that iterates through the collection.
Returns: A FluidTemperatureSetIterator object that can be used to iterate through key-value pairs in the collection.

Autodesk.Revit.DB.Plumbing.FluidType
Has been extended to provide read and write access to a collection of FluidTemperature objects which represent the fluid's properties at various temperatures.
Since:
2013